The family no longer matches the properties for the System. Disconnect the family from the System?
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FamilyDoesntMatchSystemProperties { get; }
  Visual Basic
Public Shared ReadOnly Property FamilyDoesntMatchSystemProperties As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FamilyDoesntMatchSystemProperties {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SystemsFailures Class
  Autodesk.Revit.DB Namespace